<a href="https://colab.research.google.com/github/Juniorexz/DataScience/blob/main/Loc_e_iloc.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [5]:
#Loc e iloc seleciona dados
dados = {'A': [10, 15, 20, 25],
	'B': [22, 24, 26, 28],
	'C': [30, 32, 34, 36]
	}

df = pd.DataFrame(dados, index = ['a','b', 'c', 'd'])

In [6]:
df

    A   B   C
a  10  22  30
b  15  24  32
c  20  26  34
d  25  28  36

In [9]:
df.loc['a']

A    10
B    22
C    30
Name: a, dtype: int64

In [10]:
df.loc['a':'b']

    A   B   C
a  10  22  30
b  15  24  32

In [12]:
df.loc['a':'b', 'B']

a    22
b    24
Name: B, dtype: int64

In [15]:
df.loc['b':'c', 'A':'B']

    A   B
b  15  24
c  20  26

In [16]:
df.loc['a':'c', 'A':'C']

    A   B   C
a  10  22  30
b  15  24  32
c  20  26  34

In [17]:
df.loc['a':'d', 'A':'C']

    A   B   C
a  10  22  30
b  15  24  32
c  20  26  34
d  25  28  36

In [18]:
df.A

a    10
b    15
c    20
d    25
Name: A, dtype: int64

In [19]:
df ['A'] >25

a    False
b    False
c    False
d    False
Name: A, dtype: bool

In [21]:
df['A'].loc[df['A']>=15]

b    15
c    20
d    25
Name: A, dtype: int64

In [23]:
df['A'].loc[df['A']>=17]

c    20
d    25
Name: A, dtype: int64

In [31]:
df.loc[(df['A']>=10) & (df['B']>=24)]

    A   B   C
b  15  24  32
c  20  26  34
d  25  28  36

In [32]:
df.loc[(df['A']>=10) | (df['B']>=24)]

    A   B   C
a  10  22  30
b  15  24  32
c  20  26  34
d  25  28  36

In [33]:
df

    A   B   C
a  10  22  30
b  15  24  32
c  20  26  34
d  25  28  36

In [34]:
df.iloc[0]

A    10
B    22
C    30
Name: a, dtype: int64

In [35]:
df.iloc[0:1]

    A   B   C
a  10  22  30

In [36]:
df.iloc[0:2]

    A   B   C
a  10  22  30
b  15  24  32

In [37]:
df.iloc[2:4]

    A   B   C
c  20  26  34
d  25  28  36

In [38]:
df.iloc[1:]

    A   B   C
b  15  24  32
c  20  26  34
d  25  28  36

In [39]:
df.iloc[1,0]

15

In [40]:
df.iloc[1,2]

32

In [41]:
df.iloc[1:]

    A   B   C
b  15  24  32
c  20  26  34
d  25  28  36

In [42]:
df.iloc[1: 2]

    A   B   C
b  15  24  32

In [43]:
df.iloc[1, :2]

A    15
B    24
Name: b, dtype: int64

In [ ]:
#ilock pega o indice da linha ou da coluna,locke pega os valores pelo rotulo,primeiro intervalo de linhas e depois coluna